GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.inc
// Register: I2C1BTO
#define I2C1BTO I2C1BTO
I2C1BTO                                  equ 029Dh
// bitfield definitions
I2C1BTO_BTO_POSN                         equ 0000h
I2C1BTO_BTO_POSITION                     equ 0000h
I2C1BTO_BTO_SIZE                         equ 0008h
I2C1BTO_BTO_LENGTH                       equ 0008h
I2C1BTO_BTO_MASK                         equ 00FFh
I2C1BTO_I2CBTO_POSN                      equ 0000h
I2C1BTO_I2CBTO_POSITION                  equ 0000h
I2C1BTO_I2CBTO_SIZE                      equ 0008h
I2C1BTO_I2CBTO_LENGTH                    equ 0008h
I2C1BTO_I2CBTO_MASK                      equ 00FFh
I2C1BTO_BTO0_POSN                        equ 0000h
I2C1BTO_BTO0_POSITION                    equ 0000h
I2C1BTO_BTO0_SIZE                        equ 0001h
I2C1BTO_BTO0_LENGTH                      equ 0001h
I2C1BTO_BTO0_MASK                        equ 0001h
I2C1BTO_BTO1_POSN                        equ 0001h
I2C1BTO_BTO1_POSITION                    equ 0001h
I2C1BTO_BTO1_SIZE                        equ 0001h
I2C1BTO_BTO1_LENGTH                      equ 0001h
I2C1BTO_BTO1_MASK                        equ 0002h
I2C1BTO_BTO2_POSN                        equ 0002h
I2C1BTO_BTO2_POSITION                    equ 0002h
I2C1BTO_BTO2_SIZE                        equ 0001h
I2C1BTO_BTO2_LENGTH                      equ 0001h
I2C1BTO_BTO2_MASK                        equ 0004h
I2C1BTO_BTO3_POSN                        equ 0003h
I2C1BTO_BTO3_POSITION                    equ 0003h
I2C1BTO_BTO3_SIZE                        equ 0001h
I2C1BTO_BTO3_LENGTH                      equ 0001h
I2C1BTO_BTO3_MASK                        equ 0008h
I2C1BTO_I2CBTO0_POSN                     equ 0000h
I2C1BTO_I2CBTO0_POSITION                 equ 0000h
I2C1BTO_I2CBTO0_SIZE                     equ 0001h
I2C1BTO_I2CBTO0_LENGTH                   equ 0001h
I2C1BTO_I2CBTO0_MASK                     equ 0001h
I2C1BTO_I2CBTO1_POSN                     equ 0001h
I2C1BTO_I2CBTO1_POSITION                 equ 0001h
I2C1BTO_I2CBTO1_SIZE                     equ 0001h
I2C1BTO_I2CBTO1_LENGTH                   equ 0001h
I2C1BTO_I2CBTO1_MASK                     equ 0002h
I2C1BTO_I2CBTO2_POSN                     equ 0002h
I2C1BTO_I2CBTO2_POSITION                 equ 0002h
I2C1BTO_I2CBTO2_SIZE                     equ 0001h
I2C1BTO_I2CBTO2_LENGTH                   equ 0001h
I2C1BTO_I2CBTO2_MASK                     equ 0004h
I2C1BTO_I2CBTO3_POSN                     equ 0003h
I2C1BTO_I2CBTO3_POSITION                 equ 0003h
I2C1BTO_I2CBTO3_SIZE                     equ 0001h
I2C1BTO_I2CBTO3_LENGTH                   equ 0001h
I2C1BTO_I2CBTO3_MASK                     equ 0008h

// Register: U1RXB
#define U1RXB U1RXB
U1RXB                                    equ 02A1h
// bitfield definitions
U1RXB_RXB_POSN                           equ 0000h
U1RXB_RXB_POSITION                       equ 0000h
U1RXB_RXB_SIZE                           equ 0008h
U1RXB_RXB_LENGTH                         equ 0008h
U1RXB_RXB_MASK                           equ 00FFh

// Register: U1RXCHK
#define U1RXCHK U1RXCHK
U1RXCHK                                  equ 02A2h
// bitfield definitions
U1RXCHK_RXCHK_POSN                       equ 0000h
U1RXCHK_RXCHK_POSITION                   equ 0000h
U1RXCHK_RXCHK_SIZE                       equ 0008h
U1RXCHK_RXCHK_LENGTH                     equ 0008h
U1RXCHK_RXCHK_MASK                       equ 00FFh

// Register: U1TXB
#define U1TXB U1TXB
U1TXB                                    equ 02A3h
// bitfield definitions
U1TXB_TXB_POSN                           equ 0000h
U1TXB_TXB_POSITION                       equ 0000h
U1TXB_TXB_SIZE                           equ 0008h
U1TXB_TXB_LENGTH                         equ 0008h
U1TXB_TXB_MASK                           equ 00FFh

// Register: U1TXCHK
#define U1TXCHK U1TXCHK
U1TXCHK                                  equ 02A4h
// bitfield definitions
U1TXCHK_TXCHK_POSN                       equ 0000h
U1TXCHK_TXCHK_POSITION                   equ 0000h
U1TXCHK_TXCHK_SIZE                       equ 0008h
U1TXCHK_TXCHK_LENGTH                     equ 0008h
U1TXCHK_TXCHK_MASK                       equ 00FFh

// Register: U1P1
#define U1P1 U1P1
U1P1                                     equ 02A5h

// Register: U1P1L
#define U1P1L U1P1L
U1P1L                                    equ 02A5h
// bitfield definitions
U1P1L_P1L_POSN                           equ 0000h
U1P1L_P1L_POSITION                       equ 0000h
U1P1L_P1L_SIZE                           equ 0008h
U1P1L_P1L_LENGTH                         equ 0008h
U1P1L_P1L_MASK                           equ 00FFh

// Register: U1P1H
#define U1P1H U1P1H
U1P1H                                    equ 02A6h
// bitfield definitions
U1P1H_P1H_POSN                           equ 0000h
U1P1H_P1H_POSITION                       equ 0000h
U1P1H_P1H_SIZE                           equ 0001h
U1P1H_P1H_LENGTH                         equ 0001h
U1P1H_P1H_MASK                           equ 0001h

// Register: U1P2
#define U1P2 U1P2
U1P2                                     equ 02A7h

// Register: U1P2L
#define U1P2L U1P2L
U1P2L                                    equ 02A7h
// bitfield definitions
U1P2L_P2L_POSN                           equ 0000h
U1P2L_P2L_POSITION                       equ 0000h
U1P2L_P2L_SIZE                           equ 0008h
U1P2L_P2L_LENGTH                         equ 0008h
U1P2L_P2L_MASK                           equ 00FFh

// Register: U1P2H
#define U1P2H U1P2H
U1P2H                                    equ 02A8h
// bitfield definitions
U1P2H_P2H_POSN                           equ 0000h
U1P2H_P2H_POSITION                       equ 0000h
U1P2H_P2H_SIZE                           equ 0001h
U1P2H_P2H_LENGTH                         equ 0001h
U1P2H_P2H_MASK                           equ 0001h

// Register: U1P3
#define U1P3 U1P3
U1P3                                     equ 02A9h

// Register: U1P3L
#define U1P3L U1P3L
U1P3L                                    equ 02A9h
// bitfield definitions
U1P3L_P3L_POSN                           equ 0000h
U1P3L_P3L_POSITION                       equ 0000h
U1P3L_P3L_SIZE                           equ 0008h
U1P3L_P3L_LENGTH                         equ 0008h
U1P3L_P3L_MASK                           equ 00FFh

// Register: U1P3H
#define U1P3H U1P3H
U1P3H                                    equ 02AAh
// bitfield definitions
U1P3H_P3H_POSN                           equ 0000h
U1P3H_P3H_POSITION                       equ 0000h
U1P3H_P3H_SIZE                           equ 0001h
U1P3H_P3H_LENGTH                         equ 0001h
U1P3H_P3H_MASK                           equ 0001h

// Register: U1CON0
#define U1CON0 U1CON0
U1CON0                                   equ 02ABh
// bitfield definitions
U1CON0_MODE0_POSN                        equ 0000h
U1CON0_MODE0_POSITION                    equ 0000h
U1CON0_MODE0_SIZE                        equ 0001h
U1CON0_MODE0_LENGTH                      equ 0001h
U1CON0_MODE0_MASK                        equ 0001h
U1CON0_MODE1_POSN                        equ 0001h
U1CON0_MODE1_POSITION                    equ 0001h
U1CON0_MODE1_SIZE                        equ 0001h
U1CON0_MODE1_LENGTH                      equ 0001h
U1CON0_MODE1_MASK                        equ 0002h
U1CON0_MODE2_POSN                        equ 0002h
U1CON0_MODE2_POSITION                    equ 0002h
U1CON0_MODE2_SIZE                        equ 0001h
U1CON0_MODE2_LENGTH                      equ 0001h
U1CON0_MODE2_MASK                        equ 0004h
U1CON0_MODE3_POSN                        equ 0003h
U1CON0_MODE3_POSITION                    equ 0003h
U1CON0_MODE3_SIZE                        equ 0001h
U1CON0_MODE3_LENGTH                      equ 0001h
U1CON0_MODE3_MASK                        equ 0008h
U1CON0_U1MODE_POSN                       equ 0000h
U1CON0_U1MODE_POSITION                   equ 0000h
U1CON0_U1MODE_SIZE                       equ 0004h
U1CON0_U1MODE_LENGTH                     equ 0004h
U1CON0_U1MODE_MASK                       equ 000Fh
U1CON0_U1RXEN_POSN                       equ 0004h
U1CON0_U1RXEN_POSITION                   equ 0004h
U1CON0_U1RXEN_SIZE                       equ 0001h
U1CON0_U1RXEN_LENGTH                     equ 0001h
U1CON0_U1RXEN_MASK                       equ 0010h
U1CON0_U1TXEN_POSN                       equ 0005h
U1CON0_U1TXEN_POSITION                   equ 0005h
U1CON0_U1TXEN_SIZE                       equ 0001h
U1CON0_U1TXEN_LENGTH                     equ 0001h
U1CON0_U1TXEN_MASK                       equ 0020h
U1CON0_U1ABDEN_POSN                      equ 0006h
U1CON0_U1ABDEN_POSITION                  equ 0006h
U1CON0_U1ABDEN_SIZE                      equ 0001h
U1CON0_U1ABDEN_LENGTH                    equ 0001h
U1CON0_U1ABDEN_MASK                      equ 0040h
U1CON0_U1BRGS_POSN                       equ 0007h
U1CON0_U1BRGS_POSITION                   equ 0007h
U1CON0_U1BRGS_SIZE                       equ 0001h
U1CON0_U1BRGS_LENGTH                     equ 0001h
U1CON0_U1BRGS_MASK                       equ 0080h
U1CON0_U1MODE0_POSN                      equ 0000h
U1CON0_U1MODE0_POSITION                  equ 0000h
U1CON0_U1MODE0_SIZE                      equ 0001h
U1CON0_U1MODE0_LENGTH                    equ 0001h
U1CON0_U1MODE0_MASK                      equ 0001h
U1CON0_U1MODE1_POSN                      equ 0001h
U1CON0_U1MODE1_POSITION                  equ 0001h
U1CON0_U1MODE1_SIZE                      equ 0001h
U1CON0_U1MODE1_LENGTH                    equ 0001h
U1CON0_U1MODE1_MASK                      equ 0002h
U1CON0_U1MODE2_POSN                      equ 0002h
U1CON0_U1MODE2_POSITION                  equ 0002h
U1CON0_U1MODE2_SIZE                      equ 0001h
U1CON0_U1MODE2_LENGTH                    equ 0001h
U1CON0_U1MODE2_MASK                      equ 0004h
U1CON0_U1MODE3_POSN                      equ 0003h
U1CON0_U1MODE3_POSITION                  equ 0003h
U1CON0_U1MODE3_SIZE                      equ 0001h
U1CON0_U1MODE3_LENGTH                    equ 0001h
U1CON0_U1MODE3_MASK                      equ 0008h
U1CON0_MODE_POSN                         equ 0000h
U1CON0_MODE_POSITION                     equ 0000h
U1CON0_MODE_SIZE                         equ 0004h
U1CON0_MODE_LENGTH                       equ 0004h
U1CON0_MODE_MASK                         equ 000Fh
U1CON0_RXEN_POSN                         equ 0004h
U1CON0_RXEN_POSITION                     equ 0004h
U1CON0_RXEN_SIZE                         equ 0001h
U1CON0_RXEN_LENGTH                       equ 0001h
U1CON0_RXEN_MASK                         equ 0010h
U1CON0_TXEN_POSN                         equ 0005h
U1CON0_TXEN_POSITION                     equ 0005h
U1CON0_TXEN_SIZE                         equ 0001h
U1CON0_TXEN_LENGTH                       equ 0001h
U1CON0_TXEN_MASK                         equ 0020h
U1CON0_ABDEN_POSN                        equ 0006h
U1CON0_ABDEN_POSITION                    equ 0006h
U1CON0_ABDEN_SIZE                        equ 0001h
U1CON0_ABDEN_LENGTH                      equ 0001h
U1CON0_ABDEN_MASK                        equ 0040h
U1CON0_BRGS_POSN                         equ 0007h
U1CON0_BRGS_POSITION                     equ 0007h
U1CON0_BRGS_SIZE                         equ 0001h
U1CON0_BRGS_LENGTH                       equ 0001h
U1CON0_BRGS_MASK                         equ 0080h

// Register: U1CON1
#define U1CON1 U1CON1
U1CON1                                   equ 02ACh
// bitfield definitions
U1CON1_SENDB_POSN                        equ 0000h
U1CON1_SENDB_POSITION                    equ 0000h
U1CON1_SENDB_SIZE                        equ 0001h
U1CON1_SENDB_LENGTH                      equ 0001h
U1CON1_SENDB_MASK                        equ 0001h
U1CON1_BRKOVR_POSN                       equ 0001h
U1CON1_BRKOVR_POSITION                   equ 0001h
U1CON1_BRKOVR_SIZE                       equ 0001h
U1CON1_BRKOVR_LENGTH                     equ 0001h
U1CON1_BRKOVR_MASK                       equ 0002h
U1CON1_RXBIMD_POSN                       equ 0003h
U1CON1_RXBIMD_POSITION                   equ 0003h
U1CON1_RXBIMD_SIZE                       equ 0001h
U1CON1_RXBIMD_LENGTH                     equ 0001h
U1CON1_RXBIMD_MASK                       equ 0008h
U1CON1_WUE_POSN                          equ 0004h
U1CON1_WUE_POSITION                      equ 0004h
U1CON1_WUE_SIZE                          equ 0001h
U1CON1_WUE_LENGTH                        equ 0001h
U1CON1_WUE_MASK                          equ 0010h
U1CON1_ON_POSN                           equ 0007h
U1CON1_ON_POSITION                       equ 0007h
U1CON1_ON_SIZE                           equ 0001h
U1CON1_ON_LENGTH                         equ 0001h
U1CON1_ON_MASK                           equ 0080h
U1CON1_U1SENDB_POSN                      equ 0000h
U1CON1_U1SENDB_POSITION                  equ 0000h
U1CON1_U1SENDB_SIZE                      equ 0001h
U1CON1_U1SENDB_LENGTH                    equ 0001h
U1CON1_U1SENDB_MASK                      equ 0001h
U1CON1_U1BRKOVR_POSN                     equ 0001h
U1CON1_U1BRKOVR_POSITION                 equ 0001h
U1CON1_U1BRKOVR_SIZE                     equ 0001h
U1CON1_U1BRKOVR_LENGTH                   equ 0001h
U1CON1_U1BRKOVR_MASK                     equ 0002h
U1CON1_U1RXBIMD_POSN                     equ 0003h
U1CON1_U1RXBIMD_POSITION                 equ 0003h
U1CON1_U1RXBIMD_SIZE                     equ 0001h
U1CON1_U1RXBIMD_LENGTH                   equ 0001h
U1CON1_U1RXBIMD_MASK                     equ 0008h
U1CON1_U1WUE_POSN                        equ 0004h
U1CON1_U1WUE_POSITION                    equ 0004h
U1CON1_U1WUE_SIZE                        equ 0001h
U1CON1_U1WUE_LENGTH                      equ 0001h
U1CON1_U1WUE_MASK                        equ 0010h
U1CON1_U1ON_POSN                         equ 0007h
U1CON1_U1ON_POSITION                     equ 0007h
U1CON1_U1ON_SIZE                         equ 0001h
U1CON1_U1ON_LENGTH                       equ 0001h
U1CON1_U1ON_MASK                         equ 0080h

// Register: U1CON2
#define U1CON2 U1CON2
U1CON2                                   equ 02ADh
// bitfield definitions
U1CON2_FLO_POSN                          equ 0000h
U1CON2_FLO_POSITION                      equ 0000h
U1CON2_FLO_SIZE                          equ 0002h
U1CON2_FLO_LENGTH                        equ 0002h
U1CON2_FLO_MASK                          equ 0003h
U1CON2_TXPOL_POSN                        equ 0002h
U1CON2_TXPOL_POSITION                    equ 0002h
U1CON2_TXPOL_SIZE                        equ 0001h
U1CON2_TXPOL_LENGTH                      equ 0001h
U1CON2_TXPOL_MASK                        equ 0004h
U1CON2_C0EN_POSN                         equ 0003h
U1CON2_C0EN_POSITION                     equ 0003h
U1CON2_C0EN_SIZE                         equ 0001h
U1CON2_C0EN_LENGTH                       equ 0001h
U1CON2_C0EN_MASK                         equ 0008h
U1CON2_STP_POSN                          equ 0004h
U1CON2_STP_POSITION                      equ 0004h
U1CON2_STP_SIZE                          equ 0002h
U1CON2_STP_LENGTH                        equ 0002h
U1CON2_STP_MASK                          equ 0030h
U1CON2_RXPOL_POSN                        equ 0006h
U1CON2_RXPOL_POSITION                    equ 0006h
U1CON2_RXPOL_SIZE                        equ 0001h
U1CON2_RXPOL_LENGTH                      equ 0001h
U1CON2_RXPOL_MASK                        equ 0040h
U1CON2_RUNOVF_POSN                       equ 0007h
U1CON2_RUNOVF_POSITION                   equ 0007h
U1CON2_RUNOVF_SIZE                       equ 0001h
U1CON2_RUNOVF_LENGTH                     equ 0001h
U1CON2_RUNOVF_MASK                       equ 0080h
U1CON2_FLO0_POSN                         equ 0000h
U1CON2_FLO0_POSITION                     equ 0000h
U1CON2_FLO0_SIZE                         equ 0001h
U1CON2_FLO0_LENGTH                       equ 0001h
U1CON2_FLO0_MASK                         equ 0001h
U1CON2_FLO1_POSN                         equ 0001h
U1CON2_FLO1_POSITION                     equ 0001h
U1CON2_FLO1_SIZE                         equ 0001h
U1CON2_FLO1_LENGTH                       equ 0001h
U1CON2_FLO1_MASK                         equ 0002h
U1CON2_STP0_POSN                         equ 0004h
U1CON2_STP0_POSITION                     equ 0004h
U1CON2_STP0_SIZE                         equ 0001h
U1CON2_STP0_LENGTH                       equ 0001h
U1CON2_STP0_MASK                         equ 0010h
U1CON2_STP1_POSN                         equ 0005h
U1CON2_STP1_POSITION                     equ 0005h
U1CON2_STP1_SIZE                         equ 0001h
U1CON2_STP1_LENGTH                       equ 0001h
U1CON2_STP1_MASK                         equ 0020h
U1CON2_U1FLO_POSN                        equ 0000h
U1CON2_U1FLO_POSITION                    equ 0000h
U1CON2_U1FLO_SIZE                        equ 0002h
U1CON2_U1FLO_LENGTH                      equ 0002h
U1CON2_U1FLO_MASK                        equ 0003h
U1CON2_U1TXPOL_POSN                      equ 0002h
U1CON2_U1TXPOL_POSITION                  equ 0002h
U1CON2_U1TXPOL_SIZE                      equ 0001h
U1CON2_U1TXPOL_LENGTH                    equ 0001h
U1CON2_U1TXPOL_MASK                      equ 0004h
U1CON2_U1C0EN_POSN                       equ 0003h
U1CON2_U1C0EN_POSITION                   equ 0003h
U1CON2_U1C0EN_SIZE                       equ 0001h
U1CON2_U1C0EN_LENGTH                     equ 0001h
U1CON2_U1C0EN_MASK                       equ 0008h
U1CON2_U1STP_POSN                        equ 0004h
U1CON2_U1STP_POSITION                    equ 0004h
U1CON2_U1STP_SIZE                        equ 0002h
U1CON2_U1STP_LENGTH                      equ 0002h
U1CON2_U1STP_MASK                        equ 0030h
U1CON2_U1RXPOL_POSN                      equ 0006h
U1CON2_U1RXPOL_POSITION                  equ 0006h
U1CON2_U1RXPOL_SIZE                      equ 0001h
U1CON2_U1RXPOL_LENGTH                    equ 0001h
U1CON2_U1RXPOL_MASK                      equ 0040h
U1CON2_U1RUNOVF_POSN                     equ 0007h
U1CON2_U1RUNOVF_POSITION                 equ 0007h
U1CON2_U1RUNOVF_SIZE                     equ 0001h
U1CON2_U1RUNOVF_LENGTH                   equ 0001h
U1CON2_U1RUNOVF_MASK                     equ 0080h
U1CON2_U1FLO0_POSN                       equ 0000h
U1CON2_U1FLO0_POSITION                   equ 0000h
U1CON2_U1FLO0_SIZE                       equ 0001h
U1CON2_U1FLO0_LENGTH                     equ 0001h
U1CON2_U1FLO0_MASK                       equ 0001h
U1CON2_U1FLO1_POSN                       equ 0001h
U1CON2_U1FLO1_POSITION                   equ 0001h
U1CON2_U1FLO1_SIZE                       equ 0001h
U1CON2_U1FLO1_LENGTH                     equ 0001h
U1CON2_U1FLO1_MASK                       equ 0002h
U1CON2_U1STP0_POSN                       equ 0004h
U1CON2_U1STP0_POSITION                   equ 0004h
U1CON2_U1STP0_SIZE                       equ 0001h
U1CON2_U1STP0_LENGTH                     equ 0001h
U1CON2_U1STP0_MASK                       equ 0010h
U1CON2_U1STP1_POSN                       equ 0005h
U1CON2_U1STP1_POSITION                   equ 0005h
U1CON2_U1STP1_SIZE                       equ 0001h
U1CON2_U1STP1_LENGTH                     equ 0001h
U1CON2_U1STP1_MASK                       equ 0020h

// Register: U1BRG
#define U1BRG U1BRG
U1BRG                                    equ 02AEh

// Register: U1BRGL
#define U1BRGL U1BRGL
U1BRGL                                   equ 02AEh
// bitfield definitions
U1BRGL_BRGL_POSN                         equ 0000h
U1BRGL_BRGL_POSITION                     equ 0000h
U1BRGL_BRGL_SIZE                         equ 0008h
U1BRGL_BRGL_LENGTH                       equ 0008h
U1BRGL_BRGL_MASK                         equ 00FFh

// Register: U1BRGH
#define U1BRGH U1BRGH
U1BRGH                                   equ 02AFh
// bitfield definitions
U1BRGH_BRGH_POSN                         equ 0000h
U1BRGH_BRGH_POSITION                     equ 0000h
U1BRGH_BRGH_SIZE                         equ 0008h
U1BRGH_BRGH_LENGTH                       equ 0008h
U1BRGH_BRGH_MASK                         equ 00FFh

