GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.inc
// Register: SMT1PRL
#define SMT1PRL SMT1PRL
SMT1PRL                                  equ 0309h
// bitfield definitions
SMT1PRL_SMT1PR_POSN                      equ 0000h
SMT1PRL_SMT1PR_POSITION                  equ 0000h
SMT1PRL_SMT1PR_SIZE                      equ 0008h
SMT1PRL_SMT1PR_LENGTH                    equ 0008h
SMT1PRL_SMT1PR_MASK                      equ 00FFh
SMT1PRL_SMT1PR0_POSN                     equ 0000h
SMT1PRL_SMT1PR0_POSITION                 equ 0000h
SMT1PRL_SMT1PR0_SIZE                     equ 0001h
SMT1PRL_SMT1PR0_LENGTH                   equ 0001h
SMT1PRL_SMT1PR0_MASK                     equ 0001h
SMT1PRL_SMT1PR1_POSN                     equ 0001h
SMT1PRL_SMT1PR1_POSITION                 equ 0001h
SMT1PRL_SMT1PR1_SIZE                     equ 0001h
SMT1PRL_SMT1PR1_LENGTH                   equ 0001h
SMT1PRL_SMT1PR1_MASK                     equ 0002h
SMT1PRL_SMT1PR2_POSN                     equ 0002h
SMT1PRL_SMT1PR2_POSITION                 equ 0002h
SMT1PRL_SMT1PR2_SIZE                     equ 0001h
SMT1PRL_SMT1PR2_LENGTH                   equ 0001h
SMT1PRL_SMT1PR2_MASK                     equ 0004h
SMT1PRL_SMT1PR3_POSN                     equ 0003h
SMT1PRL_SMT1PR3_POSITION                 equ 0003h
SMT1PRL_SMT1PR3_SIZE                     equ 0001h
SMT1PRL_SMT1PR3_LENGTH                   equ 0001h
SMT1PRL_SMT1PR3_MASK                     equ 0008h
SMT1PRL_SMT1PR4_POSN                     equ 0004h
SMT1PRL_SMT1PR4_POSITION                 equ 0004h
SMT1PRL_SMT1PR4_SIZE                     equ 0001h
SMT1PRL_SMT1PR4_LENGTH                   equ 0001h
SMT1PRL_SMT1PR4_MASK                     equ 0010h
SMT1PRL_SMT1PR5_POSN                     equ 0005h
SMT1PRL_SMT1PR5_POSITION                 equ 0005h
SMT1PRL_SMT1PR5_SIZE                     equ 0001h
SMT1PRL_SMT1PR5_LENGTH                   equ 0001h
SMT1PRL_SMT1PR5_MASK                     equ 0020h
SMT1PRL_SMT1PR6_POSN                     equ 0006h
SMT1PRL_SMT1PR6_POSITION                 equ 0006h
SMT1PRL_SMT1PR6_SIZE                     equ 0001h
SMT1PRL_SMT1PR6_LENGTH                   equ 0001h
SMT1PRL_SMT1PR6_MASK                     equ 0040h
SMT1PRL_SMT1PR7_POSN                     equ 0007h
SMT1PRL_SMT1PR7_POSITION                 equ 0007h
SMT1PRL_SMT1PR7_SIZE                     equ 0001h
SMT1PRL_SMT1PR7_LENGTH                   equ 0001h
SMT1PRL_SMT1PR7_MASK                     equ 0080h

// Register: SMT1PRH
#define SMT1PRH SMT1PRH
SMT1PRH                                  equ 030Ah
// bitfield definitions
SMT1PRH_SMT1PR_POSN                      equ 0000h
SMT1PRH_SMT1PR_POSITION                  equ 0000h
SMT1PRH_SMT1PR_SIZE                      equ 0008h
SMT1PRH_SMT1PR_LENGTH                    equ 0008h
SMT1PRH_SMT1PR_MASK                      equ 00FFh
SMT1PRH_SMT1PR8_POSN                     equ 0000h
SMT1PRH_SMT1PR8_POSITION                 equ 0000h
SMT1PRH_SMT1PR8_SIZE                     equ 0001h
SMT1PRH_SMT1PR8_LENGTH                   equ 0001h
SMT1PRH_SMT1PR8_MASK                     equ 0001h
SMT1PRH_SMT1PR9_POSN                     equ 0001h
SMT1PRH_SMT1PR9_POSITION                 equ 0001h
SMT1PRH_SMT1PR9_SIZE                     equ 0001h
SMT1PRH_SMT1PR9_LENGTH                   equ 0001h
SMT1PRH_SMT1PR9_MASK                     equ 0002h
SMT1PRH_SMT1PR10_POSN                    equ 0002h
SMT1PRH_SMT1PR10_POSITION                equ 0002h
SMT1PRH_SMT1PR10_SIZE                    equ 0001h
SMT1PRH_SMT1PR10_LENGTH                  equ 0001h
SMT1PRH_SMT1PR10_MASK                    equ 0004h
SMT1PRH_SMT1PR11_POSN                    equ 0003h
SMT1PRH_SMT1PR11_POSITION                equ 0003h
SMT1PRH_SMT1PR11_SIZE                    equ 0001h
SMT1PRH_SMT1PR11_LENGTH                  equ 0001h
SMT1PRH_SMT1PR11_MASK                    equ 0008h
SMT1PRH_SMT1PR12_POSN                    equ 0004h
SMT1PRH_SMT1PR12_POSITION                equ 0004h
SMT1PRH_SMT1PR12_SIZE                    equ 0001h
SMT1PRH_SMT1PR12_LENGTH                  equ 0001h
SMT1PRH_SMT1PR12_MASK                    equ 0010h
SMT1PRH_SMT1PR13_POSN                    equ 0005h
SMT1PRH_SMT1PR13_POSITION                equ 0005h
SMT1PRH_SMT1PR13_SIZE                    equ 0001h
SMT1PRH_SMT1PR13_LENGTH                  equ 0001h
SMT1PRH_SMT1PR13_MASK                    equ 0020h
SMT1PRH_SMT1PR14_POSN                    equ 0006h
SMT1PRH_SMT1PR14_POSITION                equ 0006h
SMT1PRH_SMT1PR14_SIZE                    equ 0001h
SMT1PRH_SMT1PR14_LENGTH                  equ 0001h
SMT1PRH_SMT1PR14_MASK                    equ 0040h
SMT1PRH_SMT1PR15_POSN                    equ 0007h
SMT1PRH_SMT1PR15_POSITION                equ 0007h
SMT1PRH_SMT1PR15_SIZE                    equ 0001h
SMT1PRH_SMT1PR15_LENGTH                  equ 0001h
SMT1PRH_SMT1PR15_MASK                    equ 0080h

// Register: SMT1PRU
#define SMT1PRU SMT1PRU
SMT1PRU                                  equ 030Bh
// bitfield definitions
SMT1PRU_SMT1PR_POSN                      equ 0000h
SMT1PRU_SMT1PR_POSITION                  equ 0000h
SMT1PRU_SMT1PR_SIZE                      equ 0008h
SMT1PRU_SMT1PR_LENGTH                    equ 0008h
SMT1PRU_SMT1PR_MASK                      equ 00FFh
SMT1PRU_SMT1PR16_POSN                    equ 0000h
SMT1PRU_SMT1PR16_POSITION                equ 0000h
SMT1PRU_SMT1PR16_SIZE                    equ 0001h
SMT1PRU_SMT1PR16_LENGTH                  equ 0001h
SMT1PRU_SMT1PR16_MASK                    equ 0001h
SMT1PRU_SMT1PR17_POSN                    equ 0001h
SMT1PRU_SMT1PR17_POSITION                equ 0001h
SMT1PRU_SMT1PR17_SIZE                    equ 0001h
SMT1PRU_SMT1PR17_LENGTH                  equ 0001h
SMT1PRU_SMT1PR17_MASK                    equ 0002h
SMT1PRU_SMT1PR18_POSN                    equ 0002h
SMT1PRU_SMT1PR18_POSITION                equ 0002h
SMT1PRU_SMT1PR18_SIZE                    equ 0001h
SMT1PRU_SMT1PR18_LENGTH                  equ 0001h
SMT1PRU_SMT1PR18_MASK                    equ 0004h
SMT1PRU_SMT1PR19_POSN                    equ 0003h
SMT1PRU_SMT1PR19_POSITION                equ 0003h
SMT1PRU_SMT1PR19_SIZE                    equ 0001h
SMT1PRU_SMT1PR19_LENGTH                  equ 0001h
SMT1PRU_SMT1PR19_MASK                    equ 0008h
SMT1PRU_SMT1PR20_POSN                    equ 0004h
SMT1PRU_SMT1PR20_POSITION                equ 0004h
SMT1PRU_SMT1PR20_SIZE                    equ 0001h
SMT1PRU_SMT1PR20_LENGTH                  equ 0001h
SMT1PRU_SMT1PR20_MASK                    equ 0010h
SMT1PRU_SMT1PR21_POSN                    equ 0005h
SMT1PRU_SMT1PR21_POSITION                equ 0005h
SMT1PRU_SMT1PR21_SIZE                    equ 0001h
SMT1PRU_SMT1PR21_LENGTH                  equ 0001h
SMT1PRU_SMT1PR21_MASK                    equ 0020h
SMT1PRU_SMT1PR22_POSN                    equ 0006h
SMT1PRU_SMT1PR22_POSITION                equ 0006h
SMT1PRU_SMT1PR22_SIZE                    equ 0001h
SMT1PRU_SMT1PR22_LENGTH                  equ 0001h
SMT1PRU_SMT1PR22_MASK                    equ 0040h
SMT1PRU_SMT1PR23_POSN                    equ 0007h
SMT1PRU_SMT1PR23_POSITION                equ 0007h
SMT1PRU_SMT1PR23_SIZE                    equ 0001h
SMT1PRU_SMT1PR23_LENGTH                  equ 0001h
SMT1PRU_SMT1PR23_MASK                    equ 0080h

// Register: SMT1CON0
#define SMT1CON0 SMT1CON0
SMT1CON0                                 equ 030Ch
// bitfield definitions
SMT1CON0_SMT1PS_POSN                     equ 0000h
SMT1CON0_SMT1PS_POSITION                 equ 0000h
SMT1CON0_SMT1PS_SIZE                     equ 0002h
SMT1CON0_SMT1PS_LENGTH                   equ 0002h
SMT1CON0_SMT1PS_MASK                     equ 0003h
SMT1CON0_CPOL_POSN                       equ 0002h
SMT1CON0_CPOL_POSITION                   equ 0002h
SMT1CON0_CPOL_SIZE                       equ 0001h
SMT1CON0_CPOL_LENGTH                     equ 0001h
SMT1CON0_CPOL_MASK                       equ 0004h
SMT1CON0_SPOL_POSN                       equ 0003h
SMT1CON0_SPOL_POSITION                   equ 0003h
SMT1CON0_SPOL_SIZE                       equ 0001h
SMT1CON0_SPOL_LENGTH                     equ 0001h
SMT1CON0_SPOL_MASK                       equ 0008h
SMT1CON0_WPOL_POSN                       equ 0004h
SMT1CON0_WPOL_POSITION                   equ 0004h
SMT1CON0_WPOL_SIZE                       equ 0001h
SMT1CON0_WPOL_LENGTH                     equ 0001h
SMT1CON0_WPOL_MASK                       equ 0010h
SMT1CON0_STP_POSN                        equ 0005h
SMT1CON0_STP_POSITION                    equ 0005h
SMT1CON0_STP_SIZE                        equ 0001h
SMT1CON0_STP_LENGTH                      equ 0001h
SMT1CON0_STP_MASK                        equ 0020h
SMT1CON0_EN_POSN                         equ 0007h
SMT1CON0_EN_POSITION                     equ 0007h
SMT1CON0_EN_SIZE                         equ 0001h
SMT1CON0_EN_LENGTH                       equ 0001h
SMT1CON0_EN_MASK                         equ 0080h
SMT1CON0_SMT1PS0_POSN                    equ 0000h
SMT1CON0_SMT1PS0_POSITION                equ 0000h
SMT1CON0_SMT1PS0_SIZE                    equ 0001h
SMT1CON0_SMT1PS0_LENGTH                  equ 0001h
SMT1CON0_SMT1PS0_MASK                    equ 0001h
SMT1CON0_SMT1PS1_POSN                    equ 0001h
SMT1CON0_SMT1PS1_POSITION                equ 0001h
SMT1CON0_SMT1PS1_SIZE                    equ 0001h
SMT1CON0_SMT1PS1_LENGTH                  equ 0001h
SMT1CON0_SMT1PS1_MASK                    equ 0002h

