GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.inc
// Register: T4CON
#define T4CON T4CON
T4CON                                    equ 0330h
// bitfield definitions
T4CON_OUTPS_POSN                         equ 0000h
T4CON_OUTPS_POSITION                     equ 0000h
T4CON_OUTPS_SIZE                         equ 0004h
T4CON_OUTPS_LENGTH                       equ 0004h
T4CON_OUTPS_MASK                         equ 000Fh
T4CON_CKPS_POSN                          equ 0004h
T4CON_CKPS_POSITION                      equ 0004h
T4CON_CKPS_SIZE                          equ 0003h
T4CON_CKPS_LENGTH                        equ 0003h
T4CON_CKPS_MASK                          equ 0070h
T4CON_ON_POSN                            equ 0007h
T4CON_ON_POSITION                        equ 0007h
T4CON_ON_SIZE                            equ 0001h
T4CON_ON_LENGTH                          equ 0001h
T4CON_ON_MASK                            equ 0080h
T4CON_T4OUTPS_POSN                       equ 0000h
T4CON_T4OUTPS_POSITION                   equ 0000h
T4CON_T4OUTPS_SIZE                       equ 0004h
T4CON_T4OUTPS_LENGTH                     equ 0004h
T4CON_T4OUTPS_MASK                       equ 000Fh
T4CON_T4CKPS_POSN                        equ 0004h
T4CON_T4CKPS_POSITION                    equ 0004h
T4CON_T4CKPS_SIZE                        equ 0003h
T4CON_T4CKPS_LENGTH                      equ 0003h
T4CON_T4CKPS_MASK                        equ 0070h
T4CON_T4ON_POSN                          equ 0007h
T4CON_T4ON_POSITION                      equ 0007h
T4CON_T4ON_SIZE                          equ 0001h
T4CON_T4ON_LENGTH                        equ 0001h
T4CON_T4ON_MASK                          equ 0080h
T4CON_T4OUTPS0_POSN                      equ 0000h
T4CON_T4OUTPS0_POSITION                  equ 0000h
T4CON_T4OUTPS0_SIZE                      equ 0001h
T4CON_T4OUTPS0_LENGTH                    equ 0001h
T4CON_T4OUTPS0_MASK                      equ 0001h
T4CON_T4OUTPS1_POSN                      equ 0001h
T4CON_T4OUTPS1_POSITION                  equ 0001h
T4CON_T4OUTPS1_SIZE                      equ 0001h
T4CON_T4OUTPS1_LENGTH                    equ 0001h
T4CON_T4OUTPS1_MASK                      equ 0002h
T4CON_T4OUTPS2_POSN                      equ 0002h
T4CON_T4OUTPS2_POSITION                  equ 0002h
T4CON_T4OUTPS2_SIZE                      equ 0001h
T4CON_T4OUTPS2_LENGTH                    equ 0001h
T4CON_T4OUTPS2_MASK                      equ 0004h
T4CON_T4OUTPS3_POSN                      equ 0003h
T4CON_T4OUTPS3_POSITION                  equ 0003h
T4CON_T4OUTPS3_SIZE                      equ 0001h
T4CON_T4OUTPS3_LENGTH                    equ 0001h
T4CON_T4OUTPS3_MASK                      equ 0008h
T4CON_T4CKPS0_POSN                       equ 0004h
T4CON_T4CKPS0_POSITION                   equ 0004h
T4CON_T4CKPS0_SIZE                       equ 0001h
T4CON_T4CKPS0_LENGTH                     equ 0001h
T4CON_T4CKPS0_MASK                       equ 0010h
T4CON_T4CKPS1_POSN                       equ 0005h
T4CON_T4CKPS1_POSITION                   equ 0005h
T4CON_T4CKPS1_SIZE                       equ 0001h
T4CON_T4CKPS1_LENGTH                     equ 0001h
T4CON_T4CKPS1_MASK                       equ 0020h
T4CON_T4CKPS2_POSN                       equ 0006h
T4CON_T4CKPS2_POSITION                   equ 0006h
T4CON_T4CKPS2_SIZE                       equ 0001h
T4CON_T4CKPS2_LENGTH                     equ 0001h
T4CON_T4CKPS2_MASK                       equ 0040h
T4CON_OUTPS0_POSN                        equ 0000h
T4CON_OUTPS0_POSITION                    equ 0000h
T4CON_OUTPS0_SIZE                        equ 0001h
T4CON_OUTPS0_LENGTH                      equ 0001h
T4CON_OUTPS0_MASK                        equ 0001h
T4CON_OUTPS1_POSN                        equ 0001h
T4CON_OUTPS1_POSITION                    equ 0001h
T4CON_OUTPS1_SIZE                        equ 0001h
T4CON_OUTPS1_LENGTH                      equ 0001h
T4CON_OUTPS1_MASK                        equ 0002h
T4CON_OUTPS2_POSN                        equ 0002h
T4CON_OUTPS2_POSITION                    equ 0002h
T4CON_OUTPS2_SIZE                        equ 0001h
T4CON_OUTPS2_LENGTH                      equ 0001h
T4CON_OUTPS2_MASK                        equ 0004h
T4CON_OUTPS3_POSN                        equ 0003h
T4CON_OUTPS3_POSITION                    equ 0003h
T4CON_OUTPS3_SIZE                        equ 0001h
T4CON_OUTPS3_LENGTH                      equ 0001h
T4CON_OUTPS3_MASK                        equ 0008h
T4CON_CKPS0_POSN                         equ 0004h
T4CON_CKPS0_POSITION                     equ 0004h
T4CON_CKPS0_SIZE                         equ 0001h
T4CON_CKPS0_LENGTH                       equ 0001h
T4CON_CKPS0_MASK                         equ 0010h
T4CON_CKPS1_POSN                         equ 0005h
T4CON_CKPS1_POSITION                     equ 0005h
T4CON_CKPS1_SIZE                         equ 0001h
T4CON_CKPS1_LENGTH                       equ 0001h
T4CON_CKPS1_MASK                         equ 0020h
T4CON_CKPS2_POSN                         equ 0006h
T4CON_CKPS2_POSITION                     equ 0006h
T4CON_CKPS2_SIZE                         equ 0001h
T4CON_CKPS2_LENGTH                       equ 0001h
T4CON_CKPS2_MASK                         equ 0040h
T4CON_TMR4ON_POSN                        equ 0007h
T4CON_TMR4ON_POSITION                    equ 0007h
T4CON_TMR4ON_SIZE                        equ 0001h
T4CON_TMR4ON_LENGTH                      equ 0001h
T4CON_TMR4ON_MASK                        equ 0080h

// Register: T4HLT
#define T4HLT T4HLT
T4HLT                                    equ 0331h
// bitfield definitions
T4HLT_MODE_POSN                          equ 0000h
T4HLT_MODE_POSITION                      equ 0000h
T4HLT_MODE_SIZE                          equ 0005h
T4HLT_MODE_LENGTH                        equ 0005h
T4HLT_MODE_MASK                          equ 001Fh
T4HLT_CKSYNC_POSN                        equ 0005h
T4HLT_CKSYNC_POSITION                    equ 0005h
T4HLT_CKSYNC_SIZE                        equ 0001h
T4HLT_CKSYNC_LENGTH                      equ 0001h
T4HLT_CKSYNC_MASK                        equ 0020h
T4HLT_CKPOL_POSN                         equ 0006h
T4HLT_CKPOL_POSITION                     equ 0006h
T4HLT_CKPOL_SIZE                         equ 0001h
T4HLT_CKPOL_LENGTH                       equ 0001h
T4HLT_CKPOL_MASK                         equ 0040h
T4HLT_PSYNC_POSN                         equ 0007h
T4HLT_PSYNC_POSITION                     equ 0007h
T4HLT_PSYNC_SIZE                         equ 0001h
T4HLT_PSYNC_LENGTH                       equ 0001h
T4HLT_PSYNC_MASK                         equ 0080h
T4HLT_MODE0_POSN                         equ 0000h
T4HLT_MODE0_POSITION                     equ 0000h
T4HLT_MODE0_SIZE                         equ 0001h
T4HLT_MODE0_LENGTH                       equ 0001h
T4HLT_MODE0_MASK                         equ 0001h
T4HLT_MODE1_POSN                         equ 0001h
T4HLT_MODE1_POSITION                     equ 0001h
T4HLT_MODE1_SIZE                         equ 0001h
T4HLT_MODE1_LENGTH                       equ 0001h
T4HLT_MODE1_MASK                         equ 0002h
T4HLT_MODE2_POSN                         equ 0002h
T4HLT_MODE2_POSITION                     equ 0002h
T4HLT_MODE2_SIZE                         equ 0001h
T4HLT_MODE2_LENGTH                       equ 0001h
T4HLT_MODE2_MASK                         equ 0004h
T4HLT_MODE3_POSN                         equ 0003h
T4HLT_MODE3_POSITION                     equ 0003h
T4HLT_MODE3_SIZE                         equ 0001h
T4HLT_MODE3_LENGTH                       equ 0001h
T4HLT_MODE3_MASK                         equ 0008h
T4HLT_MODE4_POSN                         equ 0004h
T4HLT_MODE4_POSITION                     equ 0004h
T4HLT_MODE4_SIZE                         equ 0001h
T4HLT_MODE4_LENGTH                       equ 0001h
T4HLT_MODE4_MASK                         equ 0010h
T4HLT_T4MODE_POSN                        equ 0000h
T4HLT_T4MODE_POSITION                    equ 0000h
T4HLT_T4MODE_SIZE                        equ 0005h
T4HLT_T4MODE_LENGTH                      equ 0005h
T4HLT_T4MODE_MASK                        equ 001Fh
T4HLT_T4CKSYNC_POSN                      equ 0005h
T4HLT_T4CKSYNC_POSITION                  equ 0005h
T4HLT_T4CKSYNC_SIZE                      equ 0001h
T4HLT_T4CKSYNC_LENGTH                    equ 0001h
T4HLT_T4CKSYNC_MASK                      equ 0020h
T4HLT_T4CKPOL_POSN                       equ 0006h
T4HLT_T4CKPOL_POSITION                   equ 0006h
T4HLT_T4CKPOL_SIZE                       equ 0001h
T4HLT_T4CKPOL_LENGTH                     equ 0001h
T4HLT_T4CKPOL_MASK                       equ 0040h
T4HLT_T4PSYNC_POSN                       equ 0007h
T4HLT_T4PSYNC_POSITION                   equ 0007h
T4HLT_T4PSYNC_SIZE                       equ 0001h
T4HLT_T4PSYNC_LENGTH                     equ 0001h
T4HLT_T4PSYNC_MASK                       equ 0080h
T4HLT_T4MODE0_POSN                       equ 0000h
T4HLT_T4MODE0_POSITION                   equ 0000h
T4HLT_T4MODE0_SIZE                       equ 0001h
T4HLT_T4MODE0_LENGTH                     equ 0001h
T4HLT_T4MODE0_MASK                       equ 0001h
T4HLT_T4MODE1_POSN                       equ 0001h
T4HLT_T4MODE1_POSITION                   equ 0001h
T4HLT_T4MODE1_SIZE                       equ 0001h
T4HLT_T4MODE1_LENGTH                     equ 0001h
T4HLT_T4MODE1_MASK                       equ 0002h
T4HLT_T4MODE2_POSN                       equ 0002h
T4HLT_T4MODE2_POSITION                   equ 0002h
T4HLT_T4MODE2_SIZE                       equ 0001h
T4HLT_T4MODE2_LENGTH                     equ 0001h
T4HLT_T4MODE2_MASK                       equ 0004h
T4HLT_T4MODE3_POSN                       equ 0003h
T4HLT_T4MODE3_POSITION                   equ 0003h
T4HLT_T4MODE3_SIZE                       equ 0001h
T4HLT_T4MODE3_LENGTH                     equ 0001h
T4HLT_T4MODE3_MASK                       equ 0008h
T4HLT_T4MODE4_POSN                       equ 0004h
T4HLT_T4MODE4_POSITION                   equ 0004h
T4HLT_T4MODE4_SIZE                       equ 0001h
T4HLT_T4MODE4_LENGTH                     equ 0001h
T4HLT_T4MODE4_MASK                       equ 0010h

// Register: T4CLKCON
#define T4CLKCON T4CLKCON
T4CLKCON                                 equ 0332h
// bitfield definitions
T4CLKCON_CS_POSN                         equ 0000h
T4CLKCON_CS_POSITION                     equ 0000h
T4CLKCON_CS_SIZE                         equ 0008h
T4CLKCON_CS_LENGTH                       equ 0008h
T4CLKCON_CS_MASK                         equ 00FFh
T4CLKCON_CS0_POSN                        equ 0000h
T4CLKCON_CS0_POSITION                    equ 0000h
T4CLKCON_CS0_SIZE                        equ 0001h
T4CLKCON_CS0_LENGTH                      equ 0001h
T4CLKCON_CS0_MASK                        equ 0001h
T4CLKCON_CS1_POSN                        equ 0001h
T4CLKCON_CS1_POSITION                    equ 0001h
T4CLKCON_CS1_SIZE                        equ 0001h
T4CLKCON_CS1_LENGTH                      equ 0001h
T4CLKCON_CS1_MASK                        equ 0002h
T4CLKCON_CS2_POSN                        equ 0002h
T4CLKCON_CS2_POSITION                    equ 0002h
T4CLKCON_CS2_SIZE                        equ 0001h
T4CLKCON_CS2_LENGTH                      equ 0001h
T4CLKCON_CS2_MASK                        equ 0004h
T4CLKCON_CS3_POSN                        equ 0003h
T4CLKCON_CS3_POSITION                    equ 0003h
T4CLKCON_CS3_SIZE                        equ 0001h
T4CLKCON_CS3_LENGTH                      equ 0001h
T4CLKCON_CS3_MASK                        equ 0008h
T4CLKCON_CS4_POSN                        equ 0004h
T4CLKCON_CS4_POSITION                    equ 0004h
T4CLKCON_CS4_SIZE                        equ 0001h
T4CLKCON_CS4_LENGTH                      equ 0001h
T4CLKCON_CS4_MASK                        equ 0010h
T4CLKCON_CS5_POSN                        equ 0005h
T4CLKCON_CS5_POSITION                    equ 0005h
T4CLKCON_CS5_SIZE                        equ 0001h
T4CLKCON_CS5_LENGTH                      equ 0001h
T4CLKCON_CS5_MASK                        equ 0020h
T4CLKCON_T4CS_POSN                       equ 0000h
T4CLKCON_T4CS_POSITION                   equ 0000h
T4CLKCON_T4CS_SIZE                       equ 0008h
T4CLKCON_T4CS_LENGTH                     equ 0008h
T4CLKCON_T4CS_MASK                       equ 00FFh
T4CLKCON_T4CS0_POSN                      equ 0000h
T4CLKCON_T4CS0_POSITION                  equ 0000h
T4CLKCON_T4CS0_SIZE                      equ 0001h
T4CLKCON_T4CS0_LENGTH                    equ 0001h
T4CLKCON_T4CS0_MASK                      equ 0001h
T4CLKCON_T4CS1_POSN                      equ 0001h
T4CLKCON_T4CS1_POSITION                  equ 0001h
T4CLKCON_T4CS1_SIZE                      equ 0001h
T4CLKCON_T4CS1_LENGTH                    equ 0001h
T4CLKCON_T4CS1_MASK                      equ 0002h
T4CLKCON_T4CS2_POSN                      equ 0002h
T4CLKCON_T4CS2_POSITION                  equ 0002h
T4CLKCON_T4CS2_SIZE                      equ 0001h
T4CLKCON_T4CS2_LENGTH                    equ 0001h
T4CLKCON_T4CS2_MASK                      equ 0004h
T4CLKCON_T4CS3_POSN                      equ 0003h
T4CLKCON_T4CS3_POSITION                  equ 0003h
T4CLKCON_T4CS3_SIZE                      equ 0001h
T4CLKCON_T4CS3_LENGTH                    equ 0001h
T4CLKCON_T4CS3_MASK                      equ 0008h
T4CLKCON_T4CS4_POSN                      equ 0004h
T4CLKCON_T4CS4_POSITION                  equ 0004h
T4CLKCON_T4CS4_SIZE                      equ 0001h
T4CLKCON_T4CS4_LENGTH                    equ 0001h
T4CLKCON_T4CS4_MASK                      equ 0010h
T4CLKCON_T4CS5_POSN                      equ 0005h
T4CLKCON_T4CS5_POSITION                  equ 0005h
T4CLKCON_T4CS5_SIZE                      equ 0001h
T4CLKCON_T4CS5_LENGTH                    equ 0001h
T4CLKCON_T4CS5_MASK                      equ 0020h

// Register: T4RST
#define T4RST T4RST
T4RST                                    equ 0333h
// bitfield definitions
T4RST_RSEL_POSN                          equ 0000h
T4RST_RSEL_POSITION                      equ 0000h
T4RST_RSEL_SIZE                          equ 0008h
T4RST_RSEL_LENGTH                        equ 0008h
T4RST_RSEL_MASK                          equ 00FFh
T4RST_RSEL0_POSN                         equ 0000h
T4RST_RSEL0_POSITION                     equ 0000h
T4RST_RSEL0_SIZE                         equ 0001h
T4RST_RSEL0_LENGTH                       equ 0001h
T4RST_RSEL0_MASK                         equ 0001h
T4RST_RSEL1_POSN                         equ 0001h
T4RST_RSEL1_POSITION                     equ 0001h
T4RST_RSEL1_SIZE                         equ 0001h
T4RST_RSEL1_LENGTH                       equ 0001h
T4RST_RSEL1_MASK                         equ 0002h
T4RST_RSEL2_POSN                         equ 0002h
T4RST_RSEL2_POSITION                     equ 0002h
T4RST_RSEL2_SIZE                         equ 0001h
T4RST_RSEL2_LENGTH                       equ 0001h
T4RST_RSEL2_MASK                         equ 0004h
T4RST_RSEL3_POSN                         equ 0003h
T4RST_RSEL3_POSITION                     equ 0003h
T4RST_RSEL3_SIZE                         equ 0001h
T4RST_RSEL3_LENGTH                       equ 0001h
T4RST_RSEL3_MASK                         equ 0008h
T4RST_RSEL4_POSN                         equ 0004h
T4RST_RSEL4_POSITION                     equ 0004h
T4RST_RSEL4_SIZE                         equ 0001h
T4RST_RSEL4_LENGTH                       equ 0001h
T4RST_RSEL4_MASK                         equ 0010h
T4RST_RSEL5_POSN                         equ 0005h
T4RST_RSEL5_POSITION                     equ 0005h
T4RST_RSEL5_SIZE                         equ 0001h
T4RST_RSEL5_LENGTH                       equ 0001h
T4RST_RSEL5_MASK                         equ 0020h
T4RST_RSEL6_POSN                         equ 0006h
T4RST_RSEL6_POSITION                     equ 0006h
T4RST_RSEL6_SIZE                         equ 0001h
T4RST_RSEL6_LENGTH                       equ 0001h
T4RST_RSEL6_MASK                         equ 0040h
T4RST_T4RSEL_POSN                        equ 0000h
T4RST_T4RSEL_POSITION                    equ 0000h
T4RST_T4RSEL_SIZE                        equ 0008h
T4RST_T4RSEL_LENGTH                      equ 0008h
T4RST_T4RSEL_MASK                        equ 00FFh
T4RST_T4RSEL0_POSN                       equ 0000h
T4RST_T4RSEL0_POSITION                   equ 0000h
T4RST_T4RSEL0_SIZE                       equ 0001h
T4RST_T4RSEL0_LENGTH                     equ 0001h
T4RST_T4RSEL0_MASK                       equ 0001h
T4RST_T4RSEL1_POSN                       equ 0001h
T4RST_T4RSEL1_POSITION                   equ 0001h
T4RST_T4RSEL1_SIZE                       equ 0001h
T4RST_T4RSEL1_LENGTH                     equ 0001h
T4RST_T4RSEL1_MASK                       equ 0002h
T4RST_T4RSEL2_POSN                       equ 0002h
T4RST_T4RSEL2_POSITION                   equ 0002h
T4RST_T4RSEL2_SIZE                       equ 0001h
T4RST_T4RSEL2_LENGTH                     equ 0001h
T4RST_T4RSEL2_MASK                       equ 0004h
T4RST_T4RSEL3_POSN                       equ 0003h
T4RST_T4RSEL3_POSITION                   equ 0003h
T4RST_T4RSEL3_SIZE                       equ 0001h
T4RST_T4RSEL3_LENGTH                     equ 0001h
T4RST_T4RSEL3_MASK                       equ 0008h
T4RST_T4RSEL4_POSN                       equ 0004h
T4RST_T4RSEL4_POSITION                   equ 0004h
T4RST_T4RSEL4_SIZE                       equ 0001h
T4RST_T4RSEL4_LENGTH                     equ 0001h
T4RST_T4RSEL4_MASK                       equ 0010h
T4RST_T4RSEL5_POSN                       equ 0005h
T4RST_T4RSEL5_POSITION                   equ 0005h
T4RST_T4RSEL5_SIZE                       equ 0001h
T4RST_T4RSEL5_LENGTH                     equ 0001h
T4RST_T4RSEL5_MASK                       equ 0020h
T4RST_T4RSEL6_POSN                       equ 0006h
T4RST_T4RSEL6_POSITION                   equ 0006h
T4RST_T4RSEL6_SIZE                       equ 0001h
T4RST_T4RSEL6_LENGTH                     equ 0001h
T4RST_T4RSEL6_MASK                       equ 0040h

// Register: TMR5L
#define TMR5L TMR5L
TMR5L                                    equ 0334h
// bitfield definitions
TMR5L_TMR5L_POSN                         equ 0000h
TMR5L_TMR5L_POSITION                     equ 0000h
TMR5L_TMR5L_SIZE                         equ 0008h
TMR5L_TMR5L_LENGTH                       equ 0008h
TMR5L_TMR5L_MASK                         equ 00FFh
TMR5L_TMR5L0_POSN                        equ 0000h
TMR5L_TMR5L0_POSITION                    equ 0000h
TMR5L_TMR5L0_SIZE                        equ 0001h
TMR5L_TMR5L0_LENGTH                      equ 0001h
TMR5L_TMR5L0_MASK                        equ 0001h
TMR5L_TMR5L1_POSN                        equ 0001h
TMR5L_TMR5L1_POSITION                    equ 0001h
TMR5L_TMR5L1_SIZE                        equ 0001h
TMR5L_TMR5L1_LENGTH                      equ 0001h
TMR5L_TMR5L1_MASK                        equ 0002h
TMR5L_TMR5L2_POSN                        equ 0002h
TMR5L_TMR5L2_POSITION                    equ 0002h
TMR5L_TMR5L2_SIZE                        equ 0001h
TMR5L_TMR5L2_LENGTH                      equ 0001h
TMR5L_TMR5L2_MASK                        equ 0004h
TMR5L_TMR5L3_POSN                        equ 0003h
TMR5L_TMR5L3_POSITION                    equ 0003h
TMR5L_TMR5L3_SIZE                        equ 0001h
TMR5L_TMR5L3_LENGTH                      equ 0001h
TMR5L_TMR5L3_MASK                        equ 0008h
TMR5L_TMR5L4_POSN                        equ 0004h
TMR5L_TMR5L4_POSITION                    equ 0004h
TMR5L_TMR5L4_SIZE                        equ 0001h
TMR5L_TMR5L4_LENGTH                      equ 0001h
TMR5L_TMR5L4_MASK                        equ 0010h
TMR5L_TMR5L5_POSN                        equ 0005h
TMR5L_TMR5L5_POSITION                    equ 0005h
TMR5L_TMR5L5_SIZE                        equ 0001h
TMR5L_TMR5L5_LENGTH                      equ 0001h
TMR5L_TMR5L5_MASK                        equ 0020h
TMR5L_TMR5L6_POSN                        equ 0006h
TMR5L_TMR5L6_POSITION                    equ 0006h
TMR5L_TMR5L6_SIZE                        equ 0001h
TMR5L_TMR5L6_LENGTH                      equ 0001h
TMR5L_TMR5L6_MASK                        equ 0040h
TMR5L_TMR5L7_POSN                        equ 0007h
TMR5L_TMR5L7_POSITION                    equ 0007h
TMR5L_TMR5L7_SIZE                        equ 0001h
TMR5L_TMR5L7_LENGTH                      equ 0001h
TMR5L_TMR5L7_MASK                        equ 0080h

// Register: TMR5H
#define TMR5H TMR5H
TMR5H                                    equ 0335h
// bitfield definitions
TMR5H_TMR5H_POSN                         equ 0000h
TMR5H_TMR5H_POSITION                     equ 0000h
TMR5H_TMR5H_SIZE                         equ 0008h
TMR5H_TMR5H_LENGTH                       equ 0008h
TMR5H_TMR5H_MASK                         equ 00FFh
TMR5H_TMR5H0_POSN                        equ 0000h
TMR5H_TMR5H0_POSITION                    equ 0000h
TMR5H_TMR5H0_SIZE                        equ 0001h
TMR5H_TMR5H0_LENGTH                      equ 0001h
TMR5H_TMR5H0_MASK                        equ 0001h
TMR5H_TMR5H1_POSN                        equ 0001h
TMR5H_TMR5H1_POSITION                    equ 0001h
TMR5H_TMR5H1_SIZE                        equ 0001h
TMR5H_TMR5H1_LENGTH                      equ 0001h
TMR5H_TMR5H1_MASK                        equ 0002h
TMR5H_TMR5H2_POSN                        equ 0002h
TMR5H_TMR5H2_POSITION                    equ 0002h
TMR5H_TMR5H2_SIZE                        equ 0001h
TMR5H_TMR5H2_LENGTH                      equ 0001h
TMR5H_TMR5H2_MASK                        equ 0004h
TMR5H_TMR5H3_POSN                        equ 0003h
TMR5H_TMR5H3_POSITION                    equ 0003h
TMR5H_TMR5H3_SIZE                        equ 0001h
TMR5H_TMR5H3_LENGTH                      equ 0001h
TMR5H_TMR5H3_MASK                        equ 0008h
TMR5H_TMR5H4_POSN                        equ 0004h
TMR5H_TMR5H4_POSITION                    equ 0004h
TMR5H_TMR5H4_SIZE                        equ 0001h
TMR5H_TMR5H4_LENGTH                      equ 0001h
TMR5H_TMR5H4_MASK                        equ 0010h
TMR5H_TMR5H5_POSN                        equ 0005h
TMR5H_TMR5H5_POSITION                    equ 0005h
TMR5H_TMR5H5_SIZE                        equ 0001h
TMR5H_TMR5H5_LENGTH                      equ 0001h
TMR5H_TMR5H5_MASK                        equ 0020h
TMR5H_TMR5H6_POSN                        equ 0006h
TMR5H_TMR5H6_POSITION                    equ 0006h
TMR5H_TMR5H6_SIZE                        equ 0001h
TMR5H_TMR5H6_LENGTH                      equ 0001h
TMR5H_TMR5H6_MASK                        equ 0040h
TMR5H_TMR5H7_POSN                        equ 0007h
TMR5H_TMR5H7_POSITION                    equ 0007h
TMR5H_TMR5H7_SIZE                        equ 0001h
TMR5H_TMR5H7_LENGTH                      equ 0001h
TMR5H_TMR5H7_MASK                        equ 0080h

