GopalSaraf/Practicals/PSDL/include/proc/pic18f46q43.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 04A2h
// bitfield definitions
PIE4_U1RXIE_POSN                         equ 0000h
PIE4_U1RXIE_POSITION                     equ 0000h
PIE4_U1RXIE_SIZE                         equ 0001h
PIE4_U1RXIE_LENGTH                       equ 0001h
PIE4_U1RXIE_MASK                         equ 0001h
PIE4_U1TXIE_POSN                         equ 0001h
PIE4_U1TXIE_POSITION                     equ 0001h
PIE4_U1TXIE_SIZE                         equ 0001h
PIE4_U1TXIE_LENGTH                       equ 0001h
PIE4_U1TXIE_MASK                         equ 0002h
PIE4_U1EIE_POSN                          equ 0002h
PIE4_U1EIE_POSITION                      equ 0002h
PIE4_U1EIE_SIZE                          equ 0001h
PIE4_U1EIE_LENGTH                        equ 0001h
PIE4_U1EIE_MASK                          equ 0004h
PIE4_U1IE_POSN                           equ 0003h
PIE4_U1IE_POSITION                       equ 0003h
PIE4_U1IE_SIZE                           equ 0001h
PIE4_U1IE_LENGTH                         equ 0001h
PIE4_U1IE_MASK                           equ 0008h
PIE4_PWM1PIE_POSN                        equ 0006h
PIE4_PWM1PIE_POSITION                    equ 0006h
PIE4_PWM1PIE_SIZE                        equ 0001h
PIE4_PWM1PIE_LENGTH                      equ 0001h
PIE4_PWM1PIE_MASK                        equ 0040h
PIE4_PWM1IE_POSN                         equ 0007h
PIE4_PWM1IE_POSITION                     equ 0007h
PIE4_PWM1IE_SIZE                         equ 0001h
PIE4_PWM1IE_LENGTH                       equ 0001h
PIE4_PWM1IE_MASK                         equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 04A3h
// bitfield definitions
PIE5_SPI2RXIE_POSN                       equ 0000h
PIE5_SPI2RXIE_POSITION                   equ 0000h
PIE5_SPI2RXIE_SIZE                       equ 0001h
PIE5_SPI2RXIE_LENGTH                     equ 0001h
PIE5_SPI2RXIE_MASK                       equ 0001h
PIE5_SPI2TXIE_POSN                       equ 0001h
PIE5_SPI2TXIE_POSITION                   equ 0001h
PIE5_SPI2TXIE_SIZE                       equ 0001h
PIE5_SPI2TXIE_LENGTH                     equ 0001h
PIE5_SPI2TXIE_MASK                       equ 0002h
PIE5_SPI2IE_POSN                         equ 0002h
PIE5_SPI2IE_POSITION                     equ 0002h
PIE5_SPI2IE_SIZE                         equ 0001h
PIE5_SPI2IE_LENGTH                       equ 0001h
PIE5_SPI2IE_MASK                         equ 0004h
PIE5_TMR3IE_POSN                         equ 0004h
PIE5_TMR3IE_POSITION                     equ 0004h
PIE5_TMR3IE_SIZE                         equ 0001h
PIE5_TMR3IE_LENGTH                       equ 0001h
PIE5_TMR3IE_MASK                         equ 0010h
PIE5_TMR3GIE_POSN                        equ 0005h
PIE5_TMR3GIE_POSITION                    equ 0005h
PIE5_TMR3GIE_SIZE                        equ 0001h
PIE5_TMR3GIE_LENGTH                      equ 0001h
PIE5_TMR3GIE_MASK                        equ 0020h
PIE5_PWM2PIE_POSN                        equ 0006h
PIE5_PWM2PIE_POSITION                    equ 0006h
PIE5_PWM2PIE_SIZE                        equ 0001h
PIE5_PWM2PIE_LENGTH                      equ 0001h
PIE5_PWM2PIE_MASK                        equ 0040h
PIE5_PWM2IE_POSN                         equ 0007h
PIE5_PWM2IE_POSITION                     equ 0007h
PIE5_PWM2IE_SIZE                         equ 0001h
PIE5_PWM2IE_LENGTH                       equ 0001h
PIE5_PWM2IE_MASK                         equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 04A4h
// bitfield definitions
PIE6_INT1IE_POSN                         equ 0000h
PIE6_INT1IE_POSITION                     equ 0000h
PIE6_INT1IE_SIZE                         equ 0001h
PIE6_INT1IE_LENGTH                       equ 0001h
PIE6_INT1IE_MASK                         equ 0001h
PIE6_CLC2IE_POSN                         equ 0001h
PIE6_CLC2IE_POSITION                     equ 0001h
PIE6_CLC2IE_SIZE                         equ 0001h
PIE6_CLC2IE_LENGTH                       equ 0001h
PIE6_CLC2IE_MASK                         equ 0002h
PIE6_CWG1IE_POSN                         equ 0002h
PIE6_CWG1IE_POSITION                     equ 0002h
PIE6_CWG1IE_SIZE                         equ 0001h
PIE6_CWG1IE_LENGTH                       equ 0001h
PIE6_CWG1IE_MASK                         equ 0004h
PIE6_NCO1IE_POSN                         equ 0003h
PIE6_NCO1IE_POSITION                     equ 0003h
PIE6_NCO1IE_SIZE                         equ 0001h
PIE6_NCO1IE_LENGTH                       equ 0001h
PIE6_NCO1IE_MASK                         equ 0008h
PIE6_DMA2SCNTIE_POSN                     equ 0004h
PIE6_DMA2SCNTIE_POSITION                 equ 0004h
PIE6_DMA2SCNTIE_SIZE                     equ 0001h
PIE6_DMA2SCNTIE_LENGTH                   equ 0001h
PIE6_DMA2SCNTIE_MASK                     equ 0010h
PIE6_DMA2DCNTIE_POSN                     equ 0005h
PIE6_DMA2DCNTIE_POSITION                 equ 0005h
PIE6_DMA2DCNTIE_SIZE                     equ 0001h
PIE6_DMA2DCNTIE_LENGTH                   equ 0001h
PIE6_DMA2DCNTIE_MASK                     equ 0020h
PIE6_DMA2ORIE_POSN                       equ 0006h
PIE6_DMA2ORIE_POSITION                   equ 0006h
PIE6_DMA2ORIE_SIZE                       equ 0001h
PIE6_DMA2ORIE_LENGTH                     equ 0001h
PIE6_DMA2ORIE_MASK                       equ 0040h
PIE6_DMA2AIE_POSN                        equ 0007h
PIE6_DMA2AIE_POSITION                    equ 0007h
PIE6_DMA2AIE_SIZE                        equ 0001h
PIE6_DMA2AIE_LENGTH                      equ 0001h
PIE6_DMA2AIE_MASK                        equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 04A5h
// bitfield definitions
PIE7_I2C1RXIE_POSN                       equ 0000h
PIE7_I2C1RXIE_POSITION                   equ 0000h
PIE7_I2C1RXIE_SIZE                       equ 0001h
PIE7_I2C1RXIE_LENGTH                     equ 0001h
PIE7_I2C1RXIE_MASK                       equ 0001h
PIE7_I2C1TXIE_POSN                       equ 0001h
PIE7_I2C1TXIE_POSITION                   equ 0001h
PIE7_I2C1TXIE_SIZE                       equ 0001h
PIE7_I2C1TXIE_LENGTH                     equ 0001h
PIE7_I2C1TXIE_MASK                       equ 0002h
PIE7_I2C1IE_POSN                         equ 0002h
PIE7_I2C1IE_POSITION                     equ 0002h
PIE7_I2C1IE_SIZE                         equ 0001h
PIE7_I2C1IE_LENGTH                       equ 0001h
PIE7_I2C1IE_MASK                         equ 0004h
PIE7_I2C1EIE_POSN                        equ 0003h
PIE7_I2C1EIE_POSITION                    equ 0003h
PIE7_I2C1EIE_SIZE                        equ 0001h
PIE7_I2C1EIE_LENGTH                      equ 0001h
PIE7_I2C1EIE_MASK                        equ 0008h
PIE7_CLC3IE_POSN                         equ 0005h
PIE7_CLC3IE_POSITION                     equ 0005h
PIE7_CLC3IE_SIZE                         equ 0001h
PIE7_CLC3IE_LENGTH                       equ 0001h
PIE7_CLC3IE_MASK                         equ 0020h
PIE7_PWM3PIE_POSN                        equ 0006h
PIE7_PWM3PIE_POSITION                    equ 0006h
PIE7_PWM3PIE_SIZE                        equ 0001h
PIE7_PWM3PIE_LENGTH                      equ 0001h
PIE7_PWM3PIE_MASK                        equ 0040h
PIE7_PWM3IE_POSN                         equ 0007h
PIE7_PWM3IE_POSITION                     equ 0007h
PIE7_PWM3IE_SIZE                         equ 0001h
PIE7_PWM3IE_LENGTH                       equ 0001h
PIE7_PWM3IE_MASK                         equ 0080h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 04A6h
// bitfield definitions
PIE8_U2RXIE_POSN                         equ 0000h
PIE8_U2RXIE_POSITION                     equ 0000h
PIE8_U2RXIE_SIZE                         equ 0001h
PIE8_U2RXIE_LENGTH                       equ 0001h
PIE8_U2RXIE_MASK                         equ 0001h
PIE8_U2TXIE_POSN                         equ 0001h
PIE8_U2TXIE_POSITION                     equ 0001h
PIE8_U2TXIE_SIZE                         equ 0001h
PIE8_U2TXIE_LENGTH                       equ 0001h
PIE8_U2TXIE_MASK                         equ 0002h
PIE8_U2EIE_POSN                          equ 0002h
PIE8_U2EIE_POSITION                      equ 0002h
PIE8_U2EIE_SIZE                          equ 0001h
PIE8_U2EIE_LENGTH                        equ 0001h
PIE8_U2EIE_MASK                          equ 0004h
PIE8_U2IE_POSN                           equ 0003h
PIE8_U2IE_POSITION                       equ 0003h
PIE8_U2IE_SIZE                           equ 0001h
PIE8_U2IE_LENGTH                         equ 0001h
PIE8_U2IE_MASK                           equ 0008h
PIE8_TMR5IE_POSN                         equ 0004h
PIE8_TMR5IE_POSITION                     equ 0004h
PIE8_TMR5IE_SIZE                         equ 0001h
PIE8_TMR5IE_LENGTH                       equ 0001h
PIE8_TMR5IE_MASK                         equ 0010h
PIE8_TMR5GIE_POSN                        equ 0005h
PIE8_TMR5GIE_POSITION                    equ 0005h
PIE8_TMR5GIE_SIZE                        equ 0001h
PIE8_TMR5GIE_LENGTH                      equ 0001h
PIE8_TMR5GIE_MASK                        equ 0020h
PIE8_CCP2IE_POSN                         equ 0006h
PIE8_CCP2IE_POSITION                     equ 0006h
PIE8_CCP2IE_SIZE                         equ 0001h
PIE8_CCP2IE_LENGTH                       equ 0001h
PIE8_CCP2IE_MASK                         equ 0040h
PIE8_SCANIE_POSN                         equ 0007h
PIE8_SCANIE_POSITION                     equ 0007h
PIE8_SCANIE_SIZE                         equ 0001h
PIE8_SCANIE_LENGTH                       equ 0001h
PIE8_SCANIE_MASK                         equ 0080h

// Register: PIE9
#define PIE9 PIE9
PIE9                                     equ 04A7h
// bitfield definitions
PIE9_U3RXIE_POSN                         equ 0000h
PIE9_U3RXIE_POSITION                     equ 0000h
PIE9_U3RXIE_SIZE                         equ 0001h
PIE9_U3RXIE_LENGTH                       equ 0001h
PIE9_U3RXIE_MASK                         equ 0001h
PIE9_U3TXIE_POSN                         equ 0001h
PIE9_U3TXIE_POSITION                     equ 0001h
PIE9_U3TXIE_SIZE                         equ 0001h
PIE9_U3TXIE_LENGTH                       equ 0001h
PIE9_U3TXIE_MASK                         equ 0002h
PIE9_U3EIE_POSN                          equ 0002h
PIE9_U3EIE_POSITION                      equ 0002h
PIE9_U3EIE_SIZE                          equ 0001h
PIE9_U3EIE_LENGTH                        equ 0001h
PIE9_U3EIE_MASK                          equ 0004h
PIE9_U3IE_POSN                           equ 0003h
PIE9_U3IE_POSITION                       equ 0003h
PIE9_U3IE_SIZE                           equ 0001h
PIE9_U3IE_LENGTH                         equ 0001h
PIE9_U3IE_MASK                           equ 0008h
PIE9_CLC4IE_POSN                         equ 0005h
PIE9_CLC4IE_POSITION                     equ 0005h
PIE9_CLC4IE_SIZE                         equ 0001h
PIE9_CLC4IE_LENGTH                       equ 0001h
PIE9_CLC4IE_MASK                         equ 0020h

// Register: PIE10
#define PIE10 PIE10
PIE10                                    equ 04A8h
// bitfield definitions
PIE10_INT2IE_POSN                        equ 0000h
PIE10_INT2IE_POSITION                    equ 0000h
PIE10_INT2IE_SIZE                        equ 0001h
PIE10_INT2IE_LENGTH                      equ 0001h
PIE10_INT2IE_MASK                        equ 0001h
PIE10_CLC5IE_POSN                        equ 0001h
PIE10_CLC5IE_POSITION                    equ 0001h
PIE10_CLC5IE_SIZE                        equ 0001h
PIE10_CLC5IE_LENGTH                      equ 0001h
PIE10_CLC5IE_MASK                        equ 0002h
PIE10_CWG2IE_POSN                        equ 0002h
PIE10_CWG2IE_POSITION                    equ 0002h
PIE10_CWG2IE_SIZE                        equ 0001h
PIE10_CWG2IE_LENGTH                      equ 0001h
PIE10_CWG2IE_MASK                        equ 0004h
PIE10_NCO2IE_POSN                        equ 0003h
PIE10_NCO2IE_POSITION                    equ 0003h
PIE10_NCO2IE_SIZE                        equ 0001h
PIE10_NCO2IE_LENGTH                      equ 0001h
PIE10_NCO2IE_MASK                        equ 0008h
PIE10_DMA3SCNTIE_POSN                    equ 0004h
PIE10_DMA3SCNTIE_POSITION                equ 0004h
PIE10_DMA3SCNTIE_SIZE                    equ 0001h
PIE10_DMA3SCNTIE_LENGTH                  equ 0001h
PIE10_DMA3SCNTIE_MASK                    equ 0010h
PIE10_DMA3DCNTIE_POSN                    equ 0005h
PIE10_DMA3DCNTIE_POSITION                equ 0005h
PIE10_DMA3DCNTIE_SIZE                    equ 0001h
PIE10_DMA3DCNTIE_LENGTH                  equ 0001h
PIE10_DMA3DCNTIE_MASK                    equ 0020h
PIE10_DMA3ORIE_POSN                      equ 0006h
PIE10_DMA3ORIE_POSITION                  equ 0006h
PIE10_DMA3ORIE_SIZE                      equ 0001h
PIE10_DMA3ORIE_LENGTH                    equ 0001h
PIE10_DMA3ORIE_MASK                      equ 0040h
PIE10_DMA3AIE_POSN                       equ 0007h
PIE10_DMA3AIE_POSITION                   equ 0007h
PIE10_DMA3AIE_SIZE                       equ 0001h
PIE10_DMA3AIE_LENGTH                     equ 0001h
PIE10_DMA3AIE_MASK                       equ 0080h

